# coding: utf-8
# Предидущая строка нужна чтобы явно указать кодировку
# в которой написаны не ASCII символы (русский текст)

print "Здравствуй, Мир!"
print "Здравствуй снова!"
print "Мне нравится печатать"
print "Печатать - это прикольно!"
print "Круто, я печатаю!"
print "Строки нужно печатать в 'таких' кавычках"
print 'Или в "таких" кавычках'

# Упражения:
#
# 1. Выведите на печать ещё что-нибудь
# 2. Сделайте так, чтобы этот скрипт печатал только одну строку
#    из вы перечисленных выше
# 3. Напечатайте в начале строки символ "#", что он делает?
#
