# coding: utf-8

# Комментарии в коде нужны для того, чтобы
# другим людям, или вам самим, спустя какое-то время,
# было легче понять, что и зачем вы делаете в программе.

# Всё что встречается после # интерпретатор игнорирует

print "Этот код выполнится" # комментарий игнорируется

# С помощью комментариев можно "выключать" некоторый код:
# print(Этот код не выполнится)

print "Это снова выполнится"

# Упражнения:
#
# 1. (для тех, кто не догадался, что делает #) вернитесь к ex1.py
#
# 2. Напечайте код этого примера в файл, но не запускайте.
#
# 3. Прочитайте файл задом-наперед.
#    Начиная с последнего символа последней строки,
#    и заканчивая первым символом первой строки. Нашли ошибки? Исправьте их.
#
# 4. Прочитайте вслух код (в нормальном порядке) который вы написали.
#    Произносите вслух кажый спец. символ (например "двойная кавычка")
#    Нашли ошибки? Исправьте их.
#
