# coding: utf-8

# Математические операции

print "Займемся математикой:"

print "Что-то считаем", 25 + 30 / 6
print "Снова что-то считаем", 100 - 25 * 3 % 4

print "Считаем мелочь:"
print 3 + 2 + 1 - 5 + 4 % 2 - 1 / 4 + 6

print "Правда, что 3 + 2 < 5 - 7?"

print 3 + 2 < 5 - 7

print "Чему равно 3 + 2?", 3 + 2
print "Чему равно 5 - 7?", 5 - 7

print "Больше?", 5 > -2
print "Больше или равно?", 5 >= -2
print "Меньше или равно?", 5 <= -2

# Упражнения:
#
# 1. Над каждой строкой напишите комментарий (#) с
#    объяснением того, что происходит в ней
#
# 2. Запустите python без программы, и попробуйте
#    использовать интерактивную оболочку как калькулятор
#
# 3. Найдите что-нибудь, что можно посчитать,
#    например мелочь или кол-во пар в неделю, и
#    для подсчета, напишите программу аналогичную этому примеру
#
# 4. Заметили, что вычисления в этом примере неправильные?
#    "/" всегда возвращает целое число! Разберитесь, как получить
#    число с плавающей точкой (float)
#
# 5. Перепишите этот пример с использованием вычислений с плавающей точкой.
#    Подсказка: 1.0 - это число с плавающей точкой
#
